app/controllers/books_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
    flash[:notice] = "You have created book successfully"
    redirect_to book_path(@book.id)
    else
      @user = current_user
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "A"], ["body", "a"], ["user_id", 3], ["created_at", "2021-05-24 12:35:07.798568"], ["updated_at", "2021-05-24 12:35:07.798568"]]
SELECT "books".* FROM "books"

  def show
    @book = Book.new
    @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]