app/controllers/users_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = @user.books.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 25], ["OFFSET", 0]]

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", nil], ["introduction", "hello"], ["updated_at", "2021-05-22 12:28:58.223362"], ["id", 1]]